Repository: Thang-T/App_WRStudios
Catalog: lib/l10n/app_*.arb
Languages: vi

source: Home
vi: Trang chủ

source: Search
vi: Tìm kiếm

source: Profile
vi: Hồ sơ

source: Login
vi: Đăng nhập

source: Register
vi: Đăng ký

source: Logout
vi: Đăng xuất

source: Settings
vi: Cài đặt

source: Language
vi: Ngôn ngữ

source: Vietnamese
vi: Tiếng Việt

source: English
vi: Tiếng Anh

source: Post Detail
vi: Chi tiết bài đăng

source: Contact Owner
vi: Liên hệ chủ nhà

source: Call Now
vi: Gọi ngay

source: Close
vi: Đóng

source: Payment
vi: Thanh toán

source: Payment Method
vi: Phương thức thanh toán

source: Pay Now
vi: Thanh toán ngay

source: Payment Success
vi: Thanh toán thành công

source: Payment Failed
vi: Thanh toán thất bại

# requiredLogin
source: Please login to continue
vi: Vui lòng đăng nhập để tiếp tục

source: My Posts
vi: Tin đăng của tôi

source: Edit Profile
vi: Chỉnh sửa hồ sơ

source: Role
vi: Vai trò

source: Admin
vi: Quản trị viên

source: User
vi: Người dùng

source: Verified
vi: Đã xác minh

source: Not Verified
vi: Chưa xác minh

# phone
source: Phone Number
vi: Số điện thoại

source: Joined Date
vi: Tham gia từ

source: No Data
vi: Không có dữ liệu

source: Loading...
vi: Đang tải...

# error
source: An error occurred
vi: Có lỗi xảy ra

source: Retry
vi: Thử lại

source: Save
vi: Lưu

source: Cancel
vi: Hủy

source: Delete
vi: Xóa

# confirmDelete
source: Are you sure you want to delete?
vi: Bạn có chắc chắn muốn xóa không?

source: Yes
vi: Có

source: No
vi: Không

source: Filter Search
vi: Bộ lọc tìm kiếm

source: Amenities
vi: Tiện ích

# selectAmenities
source: Select available amenities
vi: Chọn các tiện ích có sẵn

source: Apply
vi: Áp dụng

# searchPlaceholder
source: Search apartments...
vi: Tìm kiếm căn hộ...

source: All
vi: Tất cả

source: Apartment
vi: Căn hộ

source: House
vi: Nhà riêng

source: Room
vi: Phòng trọ

source: Office
vi: Văn phòng

source: Welcome!
vi: Chào mừng!

# loginPrompt
source: Login to post and save favorites.
vi: Đăng nhập để đăng tin và lưu yêu thích.

source: Registration
vi: Đăng ký

# pleaseLoginToManage
source: Please login to manage posts
vi: Vui lòng đăng nhập để quản lý tin đăng

source: Please login to post
vi: Vui lòng đăng nhập để đăng tin

# membersOnly
source: Only members can access Membership
vi: Chỉ thành viên mới có thể truy cập Membership

# adminOnly
source: Only admin can access Dashboard
vi: Chỉ admin mới truy cập Dashboard

# mapApartment
source: Apartment Map
vi: Bản đồ căn hộ

# mapOsm
source: Map (OSM, free)
vi: Bản đồ (OSM, free)

source: Map (Mapbox)
vi: Bản đồ (Mapbox)

source: Admin Dashboard
vi: Bảng điều khiển Admin

# createPost
source: Create New Post
vi: Đăng tin mới

# managePremium
source: Manage Premium Plans
vi: Quản lý gói Premium

# pleaseLoginProfile
source: Please login to view profile
vi: Vui lòng đăng nhập để xem hồ sơ

source: Not updated
vi: Chưa cập nhật

source: Change Avatar
vi: Đổi ảnh đại diện

source: Delete Photo
vi: Xóa ảnh

source: Full Name
vi: Họ tên

# updateProfileSuccess
source: Profile updated successfully
vi: Cập nhật hồ sơ thành công

# updateProfileError
source: Error updating profile:
vi: Lỗi cập nhật hồ sơ:

# confirmLogout
source: Are you sure you want to logout?
vi: Bạn có chắc chắn muốn đăng xuất?

source: Phone Number
vi: Số điện thoại

source: Description
vi: Mô tả

# ownerInfo
source: Owner Information
vi: Thông tin chủ nhà

source: Reviews
vi: Đánh giá

# noReviews
source: No reviews yet
vi: Chưa có đánh giá

source: You rated
vi: Bạn đã đánh giá

# minutesAgo
source: {minutes} minutes ago
vi: {minutes} phút trước

# hoursAgo
source: {hours} hours ago
vi: {hours} giờ trước

# daysAgo
source: {days} days ago
vi: {days} ngày trước

# orderInfo
source: Order Information
vi: Thông tin đơn hàng

# bankTransferContent
source: Transfer Content
vi: Nội dung chuyển khoản

# bankTransferNote
source: After transferring, press Payment button to confirm.
vi: Sau khi chuyển khoản xong, bấm nút Thanh toán để xác nhận.

source: Processing...
vi: Đang xử lý...

source: Pay
vi: Thanh toán

# loginToPay
source: Please login to pay
vi: Vui lòng đăng nhập để thanh toán

# paymentCreated
source: Payment order created. Please transfer according to instructions
vi: Đã tạo đơn thanh toán. Vui lòng chuyển khoản theo hướng dẫn

source: Payment error:
vi: Lỗi thanh toán:

# qrNotFound
source: QR image not found. Add file to assets/payments or configure URL.
vi: Chưa tìm thấy ảnh QR. Thêm file vào assets/payments hoặc cấu hình URL.

source: Account Name
vi: Tên TK

source: Account Number
vi: Số TK

source: posts
vi: bài

# enterValidEmailBeforeRecovery
source: Enter valid email before password recovery
vi: Nhập email hợp lệ trước khi khôi phục mật khẩu

# recoveryEmailSent
source: Recovery email sent to {email}
vi: Đã gửi email khôi phục tới {email}

# recoveryError
source: Recovery error: {error}
vi: Lỗi khôi phục: {error}

source: Hello, Welcome!
vi: Xin chào, Chào mừng!

# dontHaveAccount
source: Don't have an account?
vi: Chưa có tài khoản?

source: Password
vi: Mật khẩu

source: Forgot password?
vi: Quên mật khẩu?

# adminFilled
source: Admin pre-filled via dart-define
vi: Đã điền sẵn admin qua dart-define

# loginWithSocial
source: Or login with social platforms
vi: Hoặc đăng nhập với mạng xã hội

source: Passwords do not match
vi: Mật khẩu xác nhận không khớp

# registerSuccess
source: Registration successful. Please login to continue.
vi: Đăng ký thành công. Vui lòng đăng nhập để tiếp tục.

source: Username
vi: Tên người dùng

source: Confirm Password
vi: Xác nhận mật khẩu

source: Welcome Back!
vi: Chào mừng trở lại!

# alreadyHaveAccount
source: Already have an account?
vi: Đã có tài khoản?

source: Manage Members
vi: Quản lý thành viên

# manageMembersDesc
source: View list, lock/unlock
vi: Xem danh sách, khoá/mở

source: Manage Posts
vi: Quản lý bài viết

# managePostsDesc
source: Approve, hide/show, delete
vi: Duyệt, ẩn/hiện, xoá

source: Manage Reviews
vi: Quản lý đánh giá

# manageReviewsDesc
source: View/delete comments
vi: Xem/xoá bình luận

# reportsAndStats
source: Reports & Statistics
vi: Báo cáo & Thống kê

source: System Overview
vi: Tổng quan hệ thống

source: Users
vi: Người dùng

source: AI Stats (30 days)
vi: Thống kê AI đề xuất (30 ngày)

source: Total Events
vi: Tổng sự kiện

source: Post Views
vi: Lượt xem bài

source: Add to Favorites
vi: Thêm yêu thích

source: Remove from Favorites
vi: Bỏ yêu thích

source: Top Cities
vi: Thành phố xem nhiều

source: Other
vi: Khác

source: Top Posts
vi: Bài viết xem nhiều

source: Approved
vi: Đã duyệt

source: Pending
vi: Chưa duyệt

source: Post approved
vi: Đã duyệt bài

source: Post unapproved
vi: Đã bỏ duyệt bài

# updateApprovalError
source: Update approval error: {error}
vi: Lỗi cập nhật duyệt: {error}

source: Unapprove
vi: Bỏ duyệt

source: Approve
vi: Duyệt

source: Post deleted
vi: Đã xóa bài

source: Cannot delete, post hidden
vi: Không thể xóa, đã ẩn bài

# deleteError
source: Delete error: {error}
vi: Lỗi xóa: {error}

source: Review deleted
vi: Đã xóa đánh giá

# deleteReviewError
source: Delete review error: {error}
vi: Lỗi xóa đánh giá: {error}

# adminRole
source: Admin
vi: Quản trị viên

source: Apartment Details
vi: Chi tiết căn hộ

source: Be the first to post!
vi: Hãy đăng tin đầu tiên!

# paypalNote
source: PayPal requires a server to create orders. Currently running in demo mode.
vi: PayPal sẽ cần server tạo đơn hàng. Hiện đang chạy chế độ demo.

source: Delete Post
vi: Xóa tin đăng

# confirmDeletePost
source: Are you sure you want to delete this post?
vi: Bạn có chắc chắn muốn xóa tin đăng này?

# deleteSuccess
source: Post deleted successfully
vi: Đã xóa tin đăng thành công

source: No posts yet
vi: Chưa có tin đăng nào

source: Create New Post
vi: Tạo tin đăng mới

source: Edit Post
vi: Chỉnh sửa tin đăng

# basicInfo
source: Basic Information
vi: Thông tin cơ bản

# propertySpecs
source: Property Specifications
vi: Thông số căn hộ

source: Property Images
vi: Hình ảnh căn hộ

# imageUploadHint
source: Add at least 1 image (Max 10 images)
vi: Thêm ít nhất 1 ảnh (Tối đa 10 ảnh)

source: Add Photo
vi: Thêm ảnh

source: Add
vi: Thêm

source: Uploading images...
vi: Đang upload ảnh...

# pleaseSelectImage
source: Please select at least 1 image
vi: Vui lòng chọn ít nhất 1 ảnh

source: Bedrooms
vi: Số phòng ngủ

source: Bathrooms
vi: Số phòng tắm

source: Library
vi: Thư viện

source: Photo added
vi: Đã thêm ảnh chụp mới

# photoCaptureError
source: Photo capture error: {error}
vi: Lỗi chụp ảnh: {error}

# locationError
source: Could not get location
vi: Không lấy được vị trí

# locationSuccess
source: Location acquired
vi: Đã lấy vị trí hiện tại

source: Select Location
vi: Chọn vị trí

# addedNImages
source: Added {count} images
vi: Đã thêm {count} ảnh

# photoPickError
source: Error picking photos: {error}
vi: Lỗi chọn ảnh: {error}

source: Get Current Location
vi: Lấy vị trí hiện tại

source: No location
vi: Chưa có vị trí

# addressLabel
source: Address *
vi: Địa chỉ *

# addressHint
source: House number, street, ward...
vi: Số nhà, đường, phường...

# cityLabel
source: City *
vi: Thành phố *

# cityHint
source: HCMC
vi: TP.HCM

# cityRequired
source: Please enter city
vi: Vui lòng nhập thành phố

source: Property Type
vi: Loại bất động sản

# updatePostSuccess
source: Post updated successfully
vi: Cập nhật tin đăng thành công

# createPostSuccess
source: Post created successfully
vi: Đăng tin thành công

# postLimitReached
source: You have reached the limit of {limit} posts. Please upgrade your membership.
vi: Bạn đã đạt giới hạn {limit} bài đăng. Vui lòng nâng cấp gói thành viên.

source: Upgrade Now
vi: Nâng cấp ngay

# remainingPosts
source: {count} posts remaining
vi: Còn lại {count} lượt đăng

# priceRange
source: Price Range (VND)
vi: Khoảng giá (VNĐ)

# areaRange
source: Area (m²)
vi: Diện tích (m²)

source: Search History
vi: Lịch sử tìm kiếm

source: Clear History
vi: Xóa lịch sử

# maxImagesLimit
source: You can only upload a maximum of {limit} images.
vi: Bạn chỉ được tải lên tối đa {limit} ảnh.

source: Newest
vi: Mới nhất

source: Price Asc
vi: Giá tăng

source: Price Desc
vi: Giá giảm

source: Clear Filter
vi: Xóa lọc

# filterLabel
source: Filter
vi: Bộ lọc

source: Saved
vi: Đã lưu

source: Save Search
vi: Lưu tìm kiếm

source: Search Name
vi: Tên bộ tìm kiếm

source: My Search
vi: Tìm kiếm của tôi

# outOfQuotaTitle
source: Out of Quota
vi: Hết lượt đăng tin

# outOfQuotaMsg
source: Please upgrade your plan to increase post quota.
vi: Vui lòng nâng cấp gói để tăng hạn mức đăng tin.

source: For You
vi: Dành cho bạn

# amenityAC
source: Air Conditioner
vi: Máy lạnh

# amenityWashingMachine
source: Washing Machine
vi: Máy giặt

# amenityKitchen
source: Kitchen Cabinet
vi: Tủ bếp

# amenityCableTV
source: Cable TV
vi: Truyền hình cáp

# amenityParking
source: Parking
vi: Chỗ đậu xe

# amenitySecurity
source: Security 24/7
vi: Bảo vệ 24/7

# amenityPool
source: Swimming Pool
vi: Hồ bơi

# amenityGym
source: Gym
vi: Phòng gym

# amenityPlayground
source: Kids Playground
vi: Khu vui chơi trẻ em

# amenityBalcony
source: Balcony/Terrace
vi: Ban công/sân thượng

# amenitySecuritySystem
source: Security System
vi: Hệ thống an ninh

# amenityElevator
source: Elevator
vi: Thang máy

# amenityGarage
source: Garage
vi: Nhà để xe

# amenityLargeWindows
source: Large Windows
vi: Cửa sổ lớn

# amenityFurnished
source: Fully Furnished
vi: Nội thất đầy đủ

# enterAreaForPrice
source: Please enter area to get price suggestion
vi: Vui lòng nhập diện tích để gợi ý giá

# analyzingMarket
source: Analyzing market data...
vi: Đang phân tích dữ liệu thị trường...

source: AI Price Suggestion
vi: Gợi ý giá từ AI

# basedOn
source: Based on area {area}m², type {type} and {count} amenities:
vi: Dựa trên diện tích {area}m², loại {type} và {count} tiện ích:

# aiAnalyzingImages
source: AI is analyzing images to find amenities...
vi: AI đang phân tích ảnh để tìm tiện ích...

# autoAdded
source: Automatically added: {items}
vi: Đã tự động thêm: {items}

# uploadError
source: Upload error: {error}
vi: Lỗi upload ảnh: {error}

source: Post Templates
vi: Mẫu bài đăng

# applyTemplate
source: Template applied
vi: Đã áp dụng mẫu bài đăng

# titleLabel
source: Title *
vi: Tiêu đề *

# titleHint
source: Ex: Luxury Apartment in D1
vi: VD: Căn hộ cao cấp Q1 view đẹp

# descLabel
source: Detailed Description *
vi: Mô tả chi tiết *

# descHint
source: Full description of the apartment...
vi: Mô tả đầy đủ về căn hộ...

# aiDesc
source: AI Description Suggestion
vi: AI gợi ý mô tả

# aiDescSuccess
source: Description generated automatically
vi: Đã tạo mô tả tự động

# priceLabel
source: Rent Price (VND) *
vi: Giá thuê (VNĐ) *

# enterValidNumber
source: Please enter a valid number
vi: Vui lòng nhập số hợp lệ

# areaLabel
source: Area (m²) *
vi: Diện tích (m²) *

# enterArea
source: Please enter area
vi: Vui lòng nhập diện tích

source: AI Price
vi: Gợi ý giá AI

# contactInfo
source: Contact Information
vi: Thông tin liên hệ

source: Contact Phone
vi: Số điện thoại liên hệ

source: Contact Email
vi: Email liên hệ

source: Update Post
vi: Cập nhật tin đăng

source: Post Now
vi: Đăng tin

source: Admin Portal
vi: Cổng quản trị

source: View Home
vi: Xem trang chủ

source: Manage Payments
vi: Quản lý thanh toán

# managePaymentsDesc
source: Approve and track payments
vi: Duyệt và theo dõi thanh toán

# managePlansDesc
source: Add/Edit/Delete membership plans
vi: Thêm/Sửa/Xóa gói thành viên

source: Theme
vi: Giao diện

# themeLight
source: Light
vi: Sáng

# themeDark
source: Dark
vi: Tối

# themeSystem
source: System default
vi: Theo hệ thống

# revenueStats
source: Revenue Statistics
vi: Thống kê doanh thu

source: Today
vi: Hôm nay

source: Last 7 Days
vi: 7 ngày qua

source: Last 30 Days
vi: 30 ngày qua

# transactionsSuccess
source: Successful Transactions
vi: Giao dịch thành công

# transactionsFailed
source: Failed Transactions
vi: Giao dịch thất bại

# transactionsSubmitted
source: Submitted Transactions
vi: Giao dịch chờ duyệt
